src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РМКУправляемыйРежим</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТБК_IDКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодУценки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>флПроставленаСкидкаПоАкции</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТБК_КоличествоБаллов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КодАкцизнойМарки</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/ex_Tabakon/InformationRegisters/ТБКПланыМагазинаПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТБКПланыМагазинаПоМесяцам</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипПлана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/DataProcessors/РМКУправляемыйРежим/Forms/ТБКВыполнениеПланов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос	=	Новый Запрос("ВЫБРАТЬ
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Период КАК Период,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.ТипПлана КАК ТипПлана,
	      	 	             |	ПланыМагазинаПоМесяцамСрезПоследних.Сумма КАК Сумма
	      	 	             |ИЗ
	      	 	             |	РегистрСведений.ТБКПланыМагазинаПоМесяцам.СрезПоследних КАК ПланыМагазинаПоМесяцамСрезПоследних
	      	 	             |
	      	 	             |УПОРЯДОЧИТЬ ПО
	      	 	             |	ТипПлана");
	рез = запрос.Выполнить().Выбрать();
	
	

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Диаграмма"));
	ДопустимыеТипы = Новый ОписаниеТипов(МассивТипов); 	
	
	Ном = 1;
	Пока рез.Следующий() цикл	
		СуммаФакт		=	3000;
		
		
		НазваниеДиаграммы	=	УдалениеНезначимыхСимволов1(Строка(Рез.ТипПлана));
		
		НДиаг         	= Новый РеквизитФормы(НазваниеДиаграммы, ДопустимыеТипы);

		НДиаг.Заголовок	=	Строка(Рез.ТипПлана);
		
		ДобавляемыеРеквизиты = Новый Массив;
		ДобавляемыеРеквизиты.Добавить(НДиаг);  	
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);  

		Если Найти(НРег(Строка(Рез.ТипПлана)),"личный") или Найти(НРег(Строка(Рез.ТипПлана)),"то магазина") тогда
			Диаг 				= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа2);	
		иначе
			Диаг 				= ЭтаФорма.Элементы.Добавить(НазваниеДиаграммы, Тип("ПолеФормы"), Элементы.Группа1);	
		КонецЕсли;
		
		Диаг.Вид			= ВидПоляФормы.ПолеДиаграммы; 
		Диаг.ПутьКДанным	= НазваниеДиаграммы;

		НДиаг	=	ЭтаФорма[НазваниеДиаграммы];
		НДиаг.Серии.Добавить("План");

		ТочкаПоПлану = НДиаг.УстановитьТочку("План");
		ТочкаПоФакту = НДиаг.УстановитьТочку("Факт");
		
		ТочкаПоПлану.ПриоритетЦвета	=Истина;	
		ТочкаПоПлану.Цвет	=	WebЦвета.БледноКрасноФиолетовый;
		
		
		НДиаг.УстановитьЗначение(ТочкаПоПлану
				, НДиаг.Серии[0]
				, рез.Сумма
				, Неопределено
				, Рез.ТипПлана + " "+рез.Сумма);	
				
				

				
				
		Если Ном = 4 тогда
			СуммаФакт = рез.сумма + 10000;
			
			НДиаг.УстановитьЗначение(ТочкаПоФакту
					, НДиаг.Серии[0]
					, СуммаФакт
					, Неопределено
					, "Факт. продажи" + " " + СуммаФакт);
					
			ТочкаПоФакту.ПриоритетЦвета	=Истина;	
			ТочкаПоФакту.Цвет	=	WebЦвета.ЗеленаяЛужайка;

			
		иначе
			НДиаг.УстановитьЗначение(ТочкаПоФакту
				, НДиаг.Серии[0]
				, 3000
				, Неопределено
				, "Факт. продажи" + " "+СуммаФакт);
				
		КонецЕсли;
			
			
		НДиаг.ОтображатьЛегенду	= Ложь;	 		
		НДиаг.ВидПодписей		=	ВидПодписейКДиаграмме.Значение;
		НДиаг.АвтоМаксимальноеЗначение	=	Ложь;
		НДиаг.АвтоМинимальноеЗначение	=	Ложь;
		НДиаг.МаксимальноеЗначение		=	Макс(рез.Сумма, СуммаФакт) + рез.Сумма/10;
		НДиаг.МинимальноеЗначение		=	0;



		Ном	=	Ном+1;
	КонецЦикла;   	
КонецПроцедуры

Функция УдалениеНезначимыхСимволов1 (ВходящаяСтрока) Экспорт 

	ВходящаяСтрока = СокрЛП(ВходящаяСтрока);
    ДлинаСтроки = СтрДлина(ВходящаяСтрока);
    КонечнаяСтрока = Строка("");
     
      Пока ДлинаСтроки > 0 Цикл
           
            ПервыйСимвол = Лев(ВходящаяСтрока, 1);
           
            Если Не ПустаяСтрока(ПервыйСимвол) Тогда
                  КонечнаяСтрока = КонечнаяСтрока + ПервыйСимвол;
                  Отступ = 2;
                  ДлинаСтроки = ДлинаСтроки - 1;
          Иначе
                  КонечнаяСтрока = КонечнаяСтрока + "";
                  ВходящаяСтрока = СокрЛ(ВходящаяСтрока);
                  ДлинаСтроки = СтрДлина(ВходящаяСтрока);
                  Отступ = 1;
            КонецЕсли;
           
            Если ДлинаСтроки > 1 тогда
                  ВходящаяСтрока = Сред(ВходящаяСтрока, Отступ, ДлинаСтроки);
            Иначе
              КонечнаяСтрока = КонечнаяСтрока + Сред(ВходящаяСтрока, Отступ, 1);
                  ДлинаСтроки = 0;
            КонецЕсли;
           
      КонецЦикла;
     
      Возврат КонечнаяСтрока;
КонецФункции
